{
  "movies": [
    {
      "id": 1,
      "title": "1+1",
      "year": 2011,
      "country": "Франция",
      "genre": "Драма, комедия",
      "director": "Оливье Накаш, Эрик Толедано",
      "plot": "Пострадав в результате несчастного случая, богатый аристократ Филипп нанимает в помощники человека, который менее всего подходит для этой работы, – молодого жителя предместья Дрисса, только что освободившегося из тюрьмы. Несмотря на то, что Филипп прикован к инвалидному креслу, Дриссу удается привнести в размеренную жизнь аристократа дух приключений.",
      "actors": [
        "Франсуа Клюзе",
        "Омар Си",
        "Анн Ле Ни"
      ],
      "img": "./asstets/images/1+1.webp",
      "rating": 8.8,
      "type": "фильм"
    },
    {
      "id": 2,
      "title": "Бриллиантовая рука",
      "year": 1968,
      "country": "СССР",
      "genre": "Комедия, криминал",
      "director": "Леонид Гайдай",
      "plot": "В южном городке орудует шайка валютчиков, возглавляемая Шефом и его помощником Графом (в быту — Геной Козодоевым). Скромный советский служащий и примерный семьянин Семен Семенович Горбунков отправляется в зарубежный круиз на теплоходе, где также плывет Граф, который должен забрать бриллианты в одном из восточных городов и провезти их в загипсованной руке. Но из-за недоразумения вместо жулика на условленном месте падает ничего не подозревающий Семен Семенович, и драгоценный гипс накладывают ему.",
      "actors": [
        "Юрий Никулин",
        "Андрей Миронов",
        "Анатолий Папанов",
        "Нина Гребешкова",
        "Станислав Чекан"
      ],
      "img": "./asstets/images/Брилиантовая_рука.webp",
      "rating": 8.5,
      "type": "фильм"
    },
    {
      "id": 3,
      "title": "Достучаться до небес",
      "year": 1997,
      "country": "Германия",
      "genre": "Драма, комедия, криминал",
      "director": "Томас Ян",
      "plot": "Волею судеб две абсолютные противоположности, тихоня Руди и разгильдяй Мартин, оказываются в одной больничной палате. Узнав неутешительные прогнозы, друзья решают использовать последние дни на полную катушку — угнать машину с деньгами, напиться текилы, и, конечно, увидеть море.",
      "actors": [
        "Тиль Швайгер",
        "Ян Йозеф Лиферс",
        "Тьерри Ван Вервеке",
        "Мориц Бляйбтрой",
        "Хуб Стапель"
      ],
      "img": "./asstets/images/Достучаться_до_небес.webp",
      "rating": 8.6,
      "type": "фильм"
    },
    {
      "id": 4,
      "title": "Зеленая миля",
      "year": 1999,
      "country": "США",
      "genre": "Драма, фэнтези, криминал",
      "director": "Фрэнк Дарабонт",
      "plot": "Пол Эджкомб — начальник блока смертников в тюрьме «Холодная гора», каждый из узников которого однажды проходит «зеленую милю» по пути к месту казни. Пол повидал много заключённых и надзирателей за время работы. Однако гигант Джон Коффи, обвинённый в страшном преступлении, стал одним из самых необычных обитателей блока.",
      "actors": [
        "Том Хэнкс",
        "Дэвид Морс",
        "Бонни Хант",
        "Майкл Кларк Дункан",
        "Джеймс Кромуэлл",
        "Майкл Джитер",
        "Грэм Грин"
      ],
      "img": "./asstets/images/Зеленая_миля.webp",
      "rating": 9.1,
      "type": "фильм"
    },
    {
      "id": 5,
      "title": "Бойцовский клуб",
      "year": 1999,
      "country": "США, Германия",
      "genre": "Триллер, драма, криминал",
      "director": "Дэвид Финчер",
      "plot": "Сотрудник страховой компании страдает хронической бессонницей и отчаянно пытается вырваться из мучительно скучной жизни. Однажды в очередной командировке он встречает некоего Тайлера Дёрдена — харизматического торговца мылом с извращенной философией. Тайлер уверен, что самосовершенствование — удел слабых, а единственное, ради чего стоит жить, — саморазрушение.",
      "actors": [
        "Brad Pitt",
        "Edward Norton",
        "Helena Bonham Carter"
      ],
      "img": "./asstets/images/Бойцовский_клуб.webp",
      "rating": 8.8,
      "type": "фильм"
    },
    {
      "id": 6,
      "title": "Интерстеллар",
      "year": 2014,
      "country": "США, Великобритания, Канада",
      "genre": "Фантастика, драма, приключения",
      "director": "Кристофер Нолан",
      "plot": "Когда засуха, пыльные бури и вымирание растений приводят человечество к продовольственному кризису, коллектив исследователей и учёных отправляется сквозь червоточину (которая предположительно соединяет области пространства-времени через большое расстояние) в путешествие, чтобы превзойти прежние ограничения для космических путешествий человека и найти планету с подходящими для человечества условиями.",
      "actors": [
        "Мэттью Макконахи",
        "Энн Хэтэуэй",
        "Джессика Честейн",
        "Маккензи Фой",
        "Майкл Кейн",
        "Дэвид Джеси"
      ],
      "img": "./asstets/images/Интерстеллар.webp",
      "rating": 8.6,
      "type": "фильм"
    },
    {
      "id": 7,
      "title": "Криминальное чтиво",
      "year": 1994,
      "country": "США",
      "genre": "Криминал, драма",
      "director": "Квентин Тарантино",
      "plot": "Двое бандитов Винсент Вега и Джулс Винфилд ведут философские беседы в перерывах между разборками и решением проблем с должниками криминального босса Марселласа Уоллеса. В первой истории Винсент проводит незабываемый вечер с женой Марселласа Мией. Во второй рассказывается о боксёре Бутче Кулидже, купленном Уоллесом, чтобы сдать бой. В третьей истории Винсент и Джулс по нелепой случайности попадают в неприятности.",
      "actors": [
        "Джон Траволта",
        "Сэмюэл Л. Джексон",
        "Брюс Уиллис",
        "Ума Турман",
        "Винг Реймз",
        "Тим Рот",
        "Харви Кейтель",
        "Квентин Тарантино"
      ],
      "img": "./asstets/images/Криминальное_чтиво.webp",
      "rating": 8.7,
      "type": "фильм"
    },
    {
      "id": 8,
      "title": "Ходячий замок",
      "year": 2004,
      "country": "Япония",
      "genre": "Аниме, мультфильм, фэнтези, мелодрама, приключения",
      "director": "Хаяо Миядзаки",
      "plot": "Злая ведьма заточила 18-летнюю Софи в тело старухи. Девушка-бабушка бежит из города куда глаза глядят и встречает удивительный дом на ножках, где знакомится с могущественным волшебником Хаулом и демоном Кальцифером. Кальцифер должен служить Хаулу по договору, условия которого он не может разглашать. Девушка и демон решают помочь друг другу избавиться от злых чар.",
      "actors": [
        "Тиэко Байсё",
        "Такуя Кимура",
        "Акихиро Мива",
        "Тацуя Гасюин",
        "Рюносукэ Камики",
        "Мицунори Исаки",
        "Ё Оидзуми"
      ],
      "img": "./asstets/images/Ходячий_замок.webp",
      "rating": 8.3,
      "type": "мультфильм"
    },
    {
      "id": 9,
      "title": "Унесённые призраками",
      "year": 2001,
      "country": "Япония",
      "genre": "Аниме, мультфильм, фэнтези, приключения, семейный",
      "director": "Хаяо Миядзаки",
      "plot": "Тихиро с мамой и папой переезжает в новый дом. Заблудившись по дороге, они оказываются в странном пустынном городе, где их ждет великолепный пир. Родители с жадностью набрасываются на еду и к ужасу девочки превращаются в свиней, став пленниками злой колдуньи Юбабы. Теперь, оказавшись одна среди волшебных существ и загадочных видений, Тихиро должна придумать, как избавить своих родителей от чар коварной старухи.",
      "actors": [
        "Руми Хиираги",
        "Мию Ирино",
        "Мари Нацуки",
        "Такаси Наито",
        "Ясуко Савагути",
        "Тацуя Гасюин",
        "Рюносукэ Камики",
        "Юми Тамаи"
      ],
      "img": "./asstets/images/Унесенные_призраками.webp",
      "rating": 8.5,
      "type": "мультфильм"
    },
    {
      "id": 10,
      "title": "Леон",
      "year": 1994,
      "country": "Франция, США",
      "genre": "Боевик, триллер, драма, криминал",
      "director": "Люк Бессон",
      "plot": "Профессиональный убийца Леон неожиданно для себя самого решает помочь 12-летней соседке Матильде, семью которой убили коррумпированные полицейские.",
      "actors": [
        "Жан Рено",
        "Натали Портман",
        "Гари Олдман",
        "Дэнни Айелло",
        "Питер Эппел"
      ],
      "img": "./asstets/images/Леон.webp",
      "rating": 8.7,
      "type": "фильм"
    },
    {
      "id": 11,
      "title": "Остров проклятых",
      "year": 2009,
      "country": "США",
      "genre": "Триллер, детектив, драма",
      "director": "Мартин Скорсезе",
      "plot": "Два американских судебных пристава отправляются на один из островов в штате Массачусетс, чтобы расследовать исчезновение пациентки клиники для умалишенных преступников. При проведении расследования им придется столкнуться с паутиной лжи, обрушившимся ураганом и смертельным бунтом обитателей клиники.",
      "actors": [
        "Леонардо ДиКаприо",
        "Марк Руффало",
        "Бен Кингсли",
        "Макс фон Сюдов Мишель",
        "Уильямс Эмили Мортимер"
      ],
      "img": "./asstets/images/Остров_проклятых.webp",
      "rating": 8.5,
      "type": "фильм"
    },
    {
      "id": 12,
      "title": "Властелин колец: Братство Кольца",
      "year": 2001,
      "country": "Новая Зеландия, США",
      "genre": "фэнтези, приключения, драма, боевик",
      "director": "Питер Джексон",
      "plot": "Сказания о Средиземье — это хроника Великой войны за Кольцо, длившейся не одну тысячу лет. Тот, кто владел Кольцом, получал неограниченную власть, но был обязан служить злу. Тихая деревня, где живут хоббиты. Придя на 111-й день рождения к своему старому другу Бильбо Бэггинсу, волшебник Гэндальф начинает вести разговор о кольце, которое Бильбо нашел много лет назад. Это кольцо принадлежало когда-то темному властителю Средиземья Саурону, и оно дает большую власть своему обладателю. Теперь Саурон хочет вернуть себе власть над Средиземьем. Бильбо отдает Кольцо племяннику Фродо, чтобы тот отнёс его к Роковой Горе и уничтожил.",
      "actors": [
        "Элайджа Вуд",
        "Иэн Маккеллен",
        "Шон Эстин",
        "Вигго Мортенсен",
        "Билли Бойд",
        "Доминик Монахэн",
        "Джон Рис-Дэвис"
      ],
      "img": "./asstets/images/Властелин_колец.webp",
      "rating": 8.6,
      "type": "фильм"
    },
    {
      "id": 13,
      "title": "Начало",
      "year": 2010,
      "country": "США, Великобритания",
      "genre": "фантастика, боевик, триллер, драма, детектив",
      "director": "Кристофер Нолан",
      "plot": "Кобб – талантливый вор, лучший из лучших в опасном искусстве извлечения: он крадет ценные секреты из глубин подсознания во время сна, когда человеческий разум наиболее уязвим. Редкие способности Кобба сделали его ценным игроком в привычном к предательству мире промышленного шпионажа, но они же превратили его в извечного беглеца и лишили всего, что он когда-либо любил.",
      "actors": [
        "Леонардо ДиКаприо",
        "Джозеф Гордон-Левитт",
        "Эллиот Пейдж",
        "Том Харди",
        "Кэн Ватанабэ",
        "Дилип Рао",
        "Киллиан Мерфи"
      ],
      "img": "./asstets/images/Начало.webp",
      "rating": 8.7,
      "type": "фильм"
    },
    {
      "id": 14,
      "title": "Как приручить дракона",
      "year": 2010,
      "country": "США, Франция, Великобритания",
      "genre": "Мультфильм, фэнтези, комедия, приключения, семейный",
      "director": "Дин ДеБлуа, Крис Сандерс",
      "plot": "Вы узнаете историю подростка Иккинга, которому не слишком близки традиции его героического племени, много лет ведущего войну с драконами. Мир Иккинга переворачивается с ног на голову, когда он неожиданно встречает дракона Беззубика, который поможет ему и другим викингам увидеть привычный мир с совершенно другой стороны…",
      "actors": [
        "Джей Барушель",
        "Джерард Батлер",
        "Крэйг Фергюсон",
        "Америка Феррера",
        "Джона Хилл",
        "Кристофер Минц-Плассе"
      ],
      "img": "./asstets/images/Как_приручить_дракона.webp",
      "rating": 8.2,
      "type": "мультфильм"
    },
    {
      "id": 15,
      "title": "Джентльмены",
      "year": 2019,
      "country": "США, Великобритания, Франция, Япония, Чехия",
      "genre": "Криминал, комедия, боевик",
      "director": "Гай Ричи",
      "plot": "Один ушлый американец ещё со студенческих лет приторговывал наркотиками, а теперь придумал схему нелегального обогащения с использованием поместий обедневшей английской аристократии и очень неплохо на этом разбогател. Другой пронырливый журналист приходит к Рэю, правой руке американца, и предлагает тому купить киносценарий, в котором подробно описаны преступления его босса при участии других представителей лондонского криминального мира — партнёра-еврея, китайской диаспоры, чернокожих спортсменов и даже русского олигарха.",
      "actors": [
        "Мэттью Макконахи",
        "Чарли Ханнэм",
        "Генри Голдинг",
        "Хью Грант",
        "Мишель Докери",
        "Джереми Стронг"
      ],
      "img": "./asstets/images/Джентельмены.webp",
      "rating": 8.6,
      "type": "фильм"
    },
    {
      "id": 16,
      "title": "Поймай меня, если сможешь",
      "year": 2002,
      "country": "США, Канада",
      "genre": "Криминал, биография, комедия",
      "director": "Стивен Спилберг",
      "plot": "Фрэнк Эбегнейл успел поработать врачом, адвокатом и пилотом на пассажирской авиалинии – и все это до достижения полного совершеннолетия в 21 год. Мастер в обмане и жульничестве, он также обладал искусством подделки документов, что в конечном счете принесло ему миллионы долларов, которые он получил по фальшивым чекам.",
      "actors": [
        "Леонардо ДиКаприо",
        "Том Хэнкс",
        "Кристофер Уокен",
        "Мартин Шин",
        "Натали Бай",
        "Эми Адамс",
        "Джеймс Бролин"
      ],
      "img": "./asstets/images/Поймай_меня,_если_сможешь.webp",
      "rating": 8.5,
      "type": "фильм"
    },
    {
      "id": 17,
      "title": "Назад в будущее",
      "year": 2004,
      "country": "США",
      "genre": "Фантастика, комедия, приключения",
      "director": "Роберт Земекис",
      "plot": "Подросток Марти с помощью машины времени, сооружённой его другом-профессором доком Брауном, попадает из 80-х в далекие 50-е. Там он встречается со своими будущими родителями, ещё подростками, и другом-профессором, совсем молодым.",
      "actors": [
        " Майкл Дж. Фокс",
        "Кристофер Ллойд",
        "Лиа Томпсон",
        "Криспин Гловер",
        "Томас Ф. Уилсон",
        "Клаудия Уэллс"
      ],
      "img": "./asstets/images/Назад_в_будущее.webp",
      "rating": 8.6,
      "type": "фильм"
    },
    {
      "id": 18,
      "title": "ВАЛЛ·И",
      "year": 2008,
      "country": "США",
      "genre": "Мультфильм, фантастика, приключения, семейный",
      "director": "Эндрю Стэнтон",
      "plot": "Робот ВАЛЛ·И из года в год прилежно трудится на опустевшей Земле, очищая нашу планету от гор мусора, которые оставили после себя улетевшие в космос люди. Он и не представляет, что совсем скоро произойдут невероятные события, благодаря которым он встретит друзей, поднимется к звездам и даже сумеет изменить к лучшему своих бывших хозяев, совсем позабывших родную Землю.",
      "actors": [
        "Бен Бертт",
        "Элисса Найт",
        "Джефф Гарлин",
        "Фред Уиллард",
        "Джон Ратценбергер",
        "Кэти Нэджими",
        "Сигурни Уивер"
      ],
      "img": "./asstets/images/Валли.webp",
      "rating": 8.4,
      "type": "мультфильм"
    },
    {
      "id": 19,
      "title": "Хоббит: Нежданное путешествие",
      "year": 2012,
      "country": "Новая Зеландия, США",
      "genre": "Фэнтези, приключения, боевик",
      "director": "Питер Джексон",
      "plot": "Хоббит Бильбо Бэггинс пускается в грандиозный поход, целью которого является отвоевание утраченного королевства гномов Эребор у дракона Смауга. Совершенно неожиданно с хоббитом налаживает контакт волшебник Гэндальф Серый. Так Бильбо находит себя и присоединяется к компании тринадцати гномов, возглавляемых легендарным воином Торином Дубощитом. Их путешествие пройдёт через Дикий Край, предательские земли, населенные гоблинами и орками, смертоносными варгами, гигантскими пауками, меняющим шкуры народом и волшебниками.",
      "actors": [
        "Мартин Фриман",
        "Иэн Маккеллен",
        "Ричард Армитедж",
        "Джеймс Несбитт",
        "Кен Стотт",
        "Грэм Мактавиш"
      ],
      "img": "./asstets/images/Хоббит.webp",
      "rating": 8.1,
      "type": "фильм"
    },
    {
      "id": 20,
      "title": "Пятый элемент",
      "year": 1997,
      "country": "Франция, Великобритания",
      "genre": "Фантастика, боевик, комедия, мелодрама",
      "director": "Люк Бессон",
      "plot": "Каждые пять тысяч лет открываются двери между измерениями и темные силы стремятся нарушить существующую гармонию. Каждые пять тысяч лет Вселенной нужен герой, способный противостоять этому злу. XXIII век. Нью-йоркский таксист Корбен Даллас должен решить глобальную задачу - спасение всего рода человеческого.",
      "actors": [
        "Брюс Уиллис",
        "Милла Йовович",
        "Гари Олдман",
        "Иэн Холм",
        "Крис Такер",
        "Люк Перри",
        "Брайон Джеймс"
      ],
      "img": "./asstets/images/5элемент.webp",
      "rating": 8.1,
      "type": "фильм"
    },
    {
      "id": 21,
      "title": "Гордость и предубеждение",
      "year": 2005,
      "country": "Великобритания, Франция, США",
      "genre": "драма, мелодрама",
      "director": "Джо Райт",
      "plot": "Англия, конец XVIII века. Родители пятерых сестер Беннет озабочены тем, чтобы удачно выдать дочерей замуж. И потому размеренная жизнь солидного семейства переворачивается вверх дном, когда по соседству появляется молодой джентльмен - мистер Бингли. Своевольная Элизабет знакомится с другом Бингли - красивым и высокомерным мистером Дарси, и между ними разгорается нешуточное противостояние, результатом которого может стать как любовь, так и ненависть...",
      "actors": [
        "Кира Найтли",
        "Мэттью Макфэдиен",
        "Розамунд Пайк",
        "Саймон Вудс",
        "Дональд Сазерленд",
        "Бренда Блетин",
        "Джена Мэлоун"
      ],
      "img": "./asstets/images/Гордость_и_предубеждение.webp",
      "rating": 8.1,
      "type": "фильм"
    },
    {
      "id": 22,
      "title": "Титаник",
      "year": 1997,
      "country": "США, Мексика",
      "genre": "Мелодрама, история, триллер, драма",
      "director": "Джеймс Кэмерон",
      "plot": "В первом и последнем плавании шикарного «Титаника» встречаются двое. Пассажир нижней палубы Джек выиграл билет в карты, а богатая наследница Роза отправляется в Америку, чтобы выйти замуж по расчёту. Чувства молодых людей только успевают расцвести, и даже не классовые различия создадут испытания влюблённым, а айсберг, вставший на пути считавшегося непотопляемым лайнера.",
      "actors": [
        "Леонардо ДиКаприо",
        "Кейт Уинслет",
        "Билли Зейн",
        "Кэти Бейтс",
        "Фрэнсис Фишер",
        "Глория Стюарт"
      ],
      "img": "./asstets/images/Титаник.webp",
      "rating": 8.4,
      "type": "фильм"
    },
    {
      "id": 23,
      "title": "Пираты Карибского моря: Проклятие Черной жемчужины",
      "year": 2003,
      "country": "США",
      "genre": "Фэнтези, боевик, приключения",
      "director": "Гор Вербински",
      "plot": "Жизнь харизматичного авантюриста, капитана Джека Воробья, полная увлекательных приключений, резко меняется, когда его заклятый враг капитан Барбосса похищает корабль Джека Черную Жемчужину, а затем нападает на Порт Ройал и крадет прекрасную дочь губернатора Элизабет Свонн.",
      "actors": [
        "Джонни Депп",
        "Джеффри Раш",
        "Орландо Блум",
        "Кира Найтли",
        "Джек Девенпорт",
        "Кевин МакНэлли"
      ],
      "img": "./asstets/images/Пираты_Карибского_моря.webp",
      "rating": 8.4,
      "type": "фильм"
    },
    {
      "id": 24,
      "title": "Человек-паук",
      "year": 2002,
      "country": "США",
      "genre": "Фантастика, боевик, приключения",
      "director": "Сэм Рэйми",
      "plot": "Питер Паркер – обыкновенный школьник. Однажды он отправился с классом на экскурсию, где его кусает странный паук-мутант. Через время парень почувствовал в себе нечеловеческую силу и ловкость в движении, а главное – умение лазать по стенам и метать стальную паутину. Свои способности он направляет на защиту слабых. Так Питер становится настоящим супергероем по имени Человек-паук, который помогает людям и борется с преступностью. Но там, где есть супергерой, рано или поздно всегда объявляется и суперзлодей...",
      "actors": [
        "Тоби Магуайр",
        "Уиллем Дефо",
        "Кирстен Данст",
        "Джеймс Франко",
        "Клифф Робертсон",
        "Розмари Харрис"
      ],
      "img": "./asstets/images/Человек-паук.webp",
      "rating": 7.7,
      "type": "фильм"
    },
    {
      "id": 25,
      "title": "Король Лев",
      "year": 1994,
      "country": "США",
      "genre": "Мультфильм, мюзикл, драма, приключения, семейный",
      "director": "Роджер Аллерс, Роб Минкофф",
      "plot": "У величественного Короля-Льва Муфасы рождается наследник по имени Симба. Уже в детстве любознательный малыш становится жертвой интриг своего завистливого дяди Шрама, мечтающего о власти.Симба познаёт горе утраты, предательство и изгнание, но в конце концов обретает верных друзей и находит любимую. Закалённый испытаниями, он в нелёгкой борьбе отвоёвывает своё законное место в «Круге жизни», осознав, что значит быть настоящим Королём.",
      "actors": [
        "Мэттью Бродерик",
        "Джереми Айронс",
        "Нэйтан Лейн",
        "Эрни Сабелла"
      ],
      "img": "./asstets/images/Король_лев.webp",
      "rating": 8.8,
      "type": "мультфильм"
    }
  ]
}